In [463]:
import numpy as np
import pandas as pd
#creating array from list
arr=[0,1,2,3,4]
s1=pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [464]:
#using randomness for values
n=np.random.randn(5) #random Ndarray
index=['a','b','c','d','e']
s2=pd.Series(n,index=index)
s2

a   -0.260368
b    0.733735
c   -1.928581
d    3.042077
e   -2.366661
dtype: float64

In [465]:
#using dictionary
d={'a':1,'b':2,'c':3,'d':4,'e':5}
s3=pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [466]:
#modifying the index of series
print(s1)
s1.index=['A','B','C','D','E']
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [467]:
#slicing
a=s1[2:5]
print(a)

C    2
D    3
E    4
dtype: int64

In [468]:
#appending
print(s1)
print(s3)
combined=pd.concat([s1,s3])
print("\nConcatenated: ")
combined

A    0
B    1
C    2
D    3
E    4
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64

Concatenated:

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [469]:
#removing 
combined.drop('A')

B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

<!DOCTYPE html>
<html>
<head>
  <style>
    body {
      font-family: sans-serif;
    }
    h1 {
      color: pink;
      text-align: center;
    }
    li,p{
      color: pink;
    }
  </style>
  <title>SERIES OPERATIONS</title>
</head>
<body>
  <h1>SERIES OPERATIONS</h1>
  <p>Basic operations on series:<p>
  <ol>
  <li>List to series
  <p>A list s5

In [470]:
arr1=[0,1,2,3,4,5,7]
arr2=[6,7,2,5,7]
s5=pd.Series(arr2)
s5

0    6
1    7
2    2
3    5
4    7
dtype: int64

<font color=pink>Another list s6</font>

In [471]:
s6=pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

<font color=pink>You can add series even if they have different dimensions</font>

In [472]:
s5.add(s6)

0     6.0
1     8.0
2     4.0
3     8.0
4    11.0
5     NaN
6     NaN
dtype: float64

In [473]:
s5.mul(s6)

0     0.0
1     7.0
2     4.0
3    15.0
4    28.0
5     NaN
6     NaN
dtype: float64

In [474]:
s5.div(s6)

0         inf
1    7.000000
2    1.000000
3    1.666667
4    1.750000
5         NaN
6         NaN
dtype: float64

In [475]:
print(s6)
print('median:',s6.median())
print('mean:',s6.mean())
print('Max:',s6.min())
print('Min:',s6.max())

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64
median: 3.0
mean: 3.142857142857143
Max: 0
Min: 7

<font color=pink>Remember: min() automatically takes NaN values as minimum?</font>

In [476]:
s7=s5.add(s6)
print(s7)
print('median:',s7.median())
print('mean:',s7.mean())
print('Max:',s7.min())
print('Min:',s7.max())

0     6.0
1     8.0
2     4.0
3     8.0
4    11.0
5     NaN
6     NaN
dtype: float64
median: 8.0
mean: 7.4
Max: 4.0
Min: 11.0

# Create Dataframe

In [581]:
dates=pd.date_range('today',periods=2) #define time sequencence as index
num_arr=np.array([[1, 2, 3, 4],[2, 5, 3, 1]])
columns=['A','B','C','D'] #use the table as column name

df1=pd.DataFrame(num_arr,index=dates,columns=columns)
df1

                            A  B  C  D
2025-07-25 02:06:50.978575  1  2  3  4
2025-07-26 02:06:50.978575  2  5  3  1

In [583]:
dates=pd.date_range('today',periods=6) #define time sequencence as index
num_arr=np.random.randn(6,4)
columns=['A','B','C','D'] #use the table as column name

df1=pd.DataFrame(num_arr,index=dates,columns=columns)
df1

                                   A         B         C         D
2025-07-25 02:06:53.522633 -0.394695  0.429703 -0.122463 -0.507876
2025-07-26 02:06:53.522633 -0.354846 -1.022365  0.864692 -0.737722
2025-07-27 02:06:53.522633 -0.805859  1.124714 -1.034467  1.029433
2025-07-28 02:06:53.522633  0.364369  0.408577 -0.719787  1.704958
2025-07-29 02:06:53.522633 -0.576710  1.988080  1.498259 -1.399402
2025-07-30 02:06:53.522633 -0.416107 -0.783348 -0.175306 -0.361192

In [586]:
#create dataframe with dictionary array

data={'animal':['cat','dog','snake','dog','dog','snake'],
      'age':[2.5,3,0.5,np.nan,5,2],
      'visits':[1,3,2,3,2,3],
      'priority':['yes','yes','no','yes','yes','no']}
labels = ['a','b','c','d','e','f']
df2=pd.DataFrame(data,index=labels)
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2      yes
f  snake  2.0       3       no

In [587]:
#see datatype of array
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [ ]:
#display only first 3 records of dataframe 
df3=df2.head(3)
print(df3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no

In [595]:
#display only last 3 records of dataframe 
df3=df2.tail(3)
print(df3)

  animal  age  visits priority
d    dog  NaN       3      yes
e    dog  5.0       2      yes
f  snake  2.0       3       no

In [ ]:
#this is not a call function, index() gives error
print(df2.index)
df2.columns

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [615]:
#convert DataFrame to Numpy array
print(df2)
df2.values

  animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2      yes
f  snake  2.0       3       no

array([['cat', 2.5, 1, 'yes'],
       ['dog', 3.0, 3, 'yes'],
       ['snake', 0.5, 2, 'no'],
       ['dog', nan, 3, 'yes'],
       ['dog', 5.0, 2, 'yes'],
       ['snake', 2.0, 3, 'no']], dtype=object)

In [616]:
df2.describe() #see statistical data of dataframe

            age    visits
count  5.000000  6.000000
mean   2.600000  2.333333
std    1.635543  0.816497
min    0.500000  1.000000
25%    2.000000  2.000000
50%    2.500000  2.500000
75%    3.000000  3.000000
max    5.000000  3.000000

In [617]:
df2.T #Transpose dataframe

            a    b      c    d    e      f
animal    cat  dog  snake  dog  dog  snake
age       2.5  3.0    0.5  NaN  5.0    2.0
visits      1    3      2    3    2      3
priority  yes  yes     no  yes  yes     no